Updated diagrams
